FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ПраваИНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПраваИНастройки</Name>
			<Comment>Хранит права доступа и настройки окружения пользователей</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение права / настройки</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваИНастройки</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, на уровне которого производится настройка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоНастройка</Name>
					<Comment>Право или настройка, по которой хранится значение</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваИНастройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Поле в котором хранится телефонный номер</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/ChartsOfCharacteristicTypes/ПраваИНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ПраваИНастройки</Name>
			<Comment>Классификатор прав и настроек конфигурации</Comment>
			<Type>
				<v8:Type>cfg:EnumRef.РаботаСФронтомКассира</v8:Type>
				<v8:Type>cfg:EnumRef.ИсточникиПродажАвтосервиса</v8:Type>
				<v8:Type>cfg:EnumRef.ЕдиницаИзмеренияАвтоработВПечатныхФормах</v8:Type>
				<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.Районы</v8:Type>
				<v8:Type>cfg:EnumRef.РезервыСпособыСписания</v8:Type>
				<v8:Type>cfg:EnumRef.ВидыПравДляДокументов</v8:Type>
				<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
				<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
				<v8:Type>cfg:EnumRef.ВариантыОтветов</v8:Type>
				<v8:Type>cfg:EnumRef.ВидыКонтроля</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:EnumRef.РежимыСписанияПриВозврате</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:EnumRef.РежимыВыводаКодаВДокументах</v8:Type>
				<v8:Type>cfg:CatalogRef.ПравилаМиграцииИДоступа</v8:Type>
				<v8:Type>cfg:EnumRef.ВидыРазрешенныхОтрицательныхОстатков</v8:Type>
				<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
				<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
				<v8:Type>cfg:EnumRef.ПравилаРасчетаЦеныДляЗаказаПокупателя</v8:Type>
				<v8:Type>cfg:EnumRef.ФорматПредставленияГодаВыпускаАвтомобиля</v8:Type>
				<v8:Type>cfg:EnumRef.ТипыФормФронта</v8:Type>
				<v8:Type>cfg:EnumRef.СпособКонтроляКорректностиДоговораИСкладаДокумента</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
				<v8:Type>cfg:EnumRef.ВидыПравДляСправочников</v8:Type>
				<v8:Type>cfg:EnumRef.РежимКорректировкиКоличестваВИнвентаризации</v8:Type>
				<v8:Type>cfg:EnumRef.СкидкиСпособыВыбора</v8:Type>
				<v8:Type>cfg:EnumRef.РежимФильтрации</v8:Type>
				<v8:Type>cfg:EnumRef.РежимыРегламентныхОпераций</v8:Type>
				<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
				<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
				<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыПрайсЛистов</v8:Type>
				<v8:Type>cfg:EnumRef.ОтношениеКРегламентированномуУчету</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1000</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Признак доступности права / настройки для компании/организации/подразделения/пользователя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеПравИНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНастройка</Name>
					<Comment>Настройки могут изменяться пользователем, Права изменяются только администратором</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Значение права / настройки по умолчанию</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваИНастройки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоПользователя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/CRM_Коммуникатор/Ext/Module.bsl
#Если Клиент Тогда
	
// Функция получает значение из регистра настроек, для пользователя - 
// настройку переданной в качестве Идентификатора. 
// Если Настройка истина, то пытаются получить значение настройки, а не хранилища.
//
Функция CRMПолучитьЗначениеНастройкиИлиХранилище(Пользователь, Идентификатор, Настройка=Истина) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_НастройкиИХранилище.Пользователь,
	|	CRM_НастройкиИХранилище.Идентификатор,
	|	CRM_НастройкиИХранилище.Данные,
	|	CRM_НастройкиИХранилище.Значение
	|ИЗ
	|	РегистрСведений.CRM_НастройкиИХранилище КАК CRM_НастройкиИХранилище
	|ГДЕ
	|	CRM_НастройкиИХранилище.Пользователь = &Пользователь
	|	И CRM_НастройкиИХранилище.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Пользователь",	Пользователь);
	Запрос.УстановитьПараметр("Идентификатор",	Идентификатор);
	Результат = Запрос.Выполнить();
	
	// Если результат пустой - вернем Неопределено.
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Как правило, результат один, если изменить - 
	// нужно переписать.
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Настройка Тогда
			Возврат Выборка.Значение;
		Иначе
			Возврат Выборка.Данные;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Функция получает значение из регистра настроек  для пользователя
//  настройку  переданной в качестве Идентификатора
Функция CRMЗаписатьЗначениеНастройкиИлиХранилища(Пользователь, Идентификатор, Значение, Настройка = Истина) Экспорт
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиИХранилище.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь		= Пользователь;
	МенеджерЗаписи.Идентификатор	= Идентификатор;
	Если Настройка Тогда
		МенеджерЗаписи.Значение		= Значение;
	Иначе
		МенеджерЗаписи.Данные		= Значение;
	КонецЕсли;
	МенеджерЗаписи.Записать(Истина);
КонецФункции

// Функция возвращает список значений права, установленных для пользователя.
// Если количество значений меньше количество доступных ролей, то возвращается значение по умолчанию.
//
// Параметры:
//  Право       - право, для которого определяются значения.
//  ЗначениеПоУмолчанию - значение по умолчанию для передаваемого права (возвращается в случае
// 				  отсутствия значений в регистре сведений).
//
// Возвращаемое значение:
// 	Если не находит, то возвращает значение по умолчанию. 
//
Функция CRMПолучитьЗначениеПраваПользователя(Право, ЗначениеПоУмолчанию, Пользователь) Экспорт
   //+CRM
	ПраваПользователя =  обПраво(Право, ЗначениеПоУмолчанию = Неопределено);
	ВозвращаемоеЗначение = ЗначениеПоУмолчанию;
	Для каждого ПравоПользователя Из ПраваПользователя Цикл
		Если НЕ ПравоПользователя.Значение = ЗначениеПоУмолчанию Тогда
			ВозвращаемоеЗначение = ПравоПользователя.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	//ВозвращаемоеЗначение = ЗначениеПоУмолчанию;
	//СписокНабораПрав = ПолучитьСписокНабораПрав(Пользователь);

	//Запрос = Новый Запрос;

	//Запрос.УстановитьПараметр("НаборПрав"        , СписокНабораПрав);
	//Запрос.УстановитьПараметр("ПравоПользователя", Право);

	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Значение
	//|ИЗ
	//|	РегистрСведений.ЗначенияПравПользователя КАК РегистрЗначениеПрав
	//|
	//|ГДЕ
	//|	Право = &ПравоПользователя
	//| И НаборПрав В(&НаборПрав)
	//|
	//|";

	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	Если НЕ Выборка.Значение = ВозвращаемоеЗначение Тогда
	//		ВозвращаемоеЗначение = Выборка.Значение;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;

	Возврат ВозвращаемоеЗначение;
	//-CRM
КонецФункции

// Функция преобразовывает переданный объект и поля телефонного номера в структуру
// и возвращает ее.
Функция CRMПреобразоватьКонтактВСтруктуру(Объект, Поле1, Поле2, Поле3, Поле4) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Объект", 	Объект);
	Результат.Вставить("Поле1",		СокрЛП(Поле1));
	Результат.Вставить("Поле2", 	СокрЛП(Поле2));
	Результат.Вставить("Поле3", 	СокрЛП(Поле3));
	Результат.Вставить("Поле4", 	СокрЛП(Поле4));
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли

// Формирует структуру телефонного звонка по записи регистра сведений контактная информация
//  если значение неопределено, то создает пустую структуру, сделано для удобства
//  создание структуры в одном месте.
//
Функция CRMСформироватьСтруктуруНомераИзПолей(ТекущаяСтрока = Неопределено) Экспорт
	
	СтруктураТелефона = Новый Структура;
	Если ТекущаяСтрока = Неопределено Тогда
		СтруктураТелефона.Вставить("КодСтраны",		"");
		СтруктураТелефона.Вставить("КодГорода",		"");
		СтруктураТелефона.Вставить("НомерТелефона",	"");
		СтруктураТелефона.Вставить("Внутренний",	"");
		СтруктураТелефона.Вставить("Представление",	"");
	Иначе
		СтруктураТелефона.Вставить("КодСтраны",		ТекущаяСтрока.Поле1);
		СтруктураТелефона.Вставить("КодГорода",		ТекущаяСтрока.Поле2);
		СтруктураТелефона.Вставить("НомерТелефона",	ТекущаяСтрока.Поле3);
		СтруктураТелефона.Вставить("Внутренний",	ТекущаяСтрока.Поле4);
		СтруктураТелефона.Вставить("Представление", "");
	КонецЕсли;
	CRMСформироватьПредставлениеТелефонаПоСтруктуре(СтруктураТелефона);
	Возврат СтруктураТелефона;
КонецФункции	

// Функция проверяет строку на наличие значимых символов.
//
// Параметры:
//  ВыбСтрока  – строка для проверки.
//
// Возвращаемое значение:
//   Строка - пробел или пустое значение строки.
//
Функция CRMПроверкаПустойСтроки(ВыбСтрока, ПризнакЗапятой = Истина) Экспорт

	Если ПустаяСтрока(ВыбСтрока) Тогда
		Возврат "";
	Иначе
		Возврат ?(ПризнакЗапятой,",","")+" ";
	КонецЕсли; 
	
КонецФункции // CRMПроверкаПустойСтроки()


// Процедура формирует строковое представление адреса.
Процедура CRMСформироватьПредставлениеТелефонаПоСтруктуре(СтруктураТелефона) Экспорт

	// Если не заполнены поля НомерТелефона и Внутренний номер,
	//  то принудительно скидываем представление, потому что код страны и код города 
	//  это явно мало для создания номера.
	Если ПустаяСтрока(СтруктураТелефона.НомерТелефона) И ПустаяСтрока(СтруктураТелефона.Внутренний) Тогда
		СтруктураТелефона.КодСтраны = "";
		СтруктураТелефона.КодГорода = "";
		СтруктураТелефона.Представление = "";
		Возврат;
	КонецЕсли;

	// Подкорректируем номер телефона, если заполнен внутренний номер и не заполнен номер телефона,
	//  то это точно не добавочный номер, а следовательно удаляем код страны и код города.
	Если ПустаяСтрока(СтруктураТелефона.НомерТелефона) И НЕ ПустаяСтрока(СтруктураТелефона.Внутренний) Тогда
		СтруктураТелефона.КодСтраны = "";
		СтруктураТелефона.КодГорода = "";
		СтруктураТелефона.Представление = "";
	КонецЕсли;
	
	СтруктураТелефона.Представление = СтруктураТелефона.КодСтраны;
	СтруктураТелефона.Представление = СтруктураТелефона.Представление + ?((Не ПустаяСтрока(СтруктураТелефона.КодГорода)),(CRMПроверкаПустойСтроки(СтруктураТелефона.Представление, Ложь)+"(" + СтруктураТелефона.КодГорода + ")"),"");
	СтруктураТелефона.Представление = СтруктураТелефона.Представление + ?((Не ПустаяСтрока(СтруктураТелефона.НомерТелефона)),(CRMПроверкаПустойСтроки(СтруктураТелефона.Представление, Ложь) + СтруктураТелефона.НомерТелефона),"");
	
	Если НЕ ПустаяСтрока(СтруктураТелефона.Представление) Тогда
		СтруктураТелефона.Представление = СтруктураТелефона.Представление + ?((Не ПустаяСтрока(СтруктураТелефона.Внутренний)),(CRMПроверкаПустойСтроки(СтруктураТелефона.Представление) + "доб. " + СтруктураТелефона.Внутренний),"");
	Иначе
		СтруктураТелефона.Представление = СтруктураТелефона.Внутренний;
	КонецЕсли;
	
КонецПроцедуры // СформироватьПредставление()


#Если Клиент Тогда

// Возвращает модуль.
//
// Параметры:
//  Х –(Число) Исходное число.
//
// Возвращаемое значение:
//  Число – модуль исходного числа.
//
Функция CRMМод(Х) Экспорт
	Возврат ?(Х >= 0, Х, -Х);
КонецФункции

 //Функция удаляет из переданной строки все символы кроме цифр 
//
Функция CRMОчиститьТелефонОтРазделителей(Телефон)  Экспорт
		
	НовыйТелефон = "";
	а = 1;
	Пока а <= СтрДлина(Телефон) Цикл
		Симв =  Сред(Телефон, а, 1);
		Если (КодСимвола(Симв) >= 48 И КодСимвола(Симв) <= 57) Тогда
			НовыйТелефон = НовыйТелефон + Симв;
		КонецЕсли;
		а = а + 1;
	КонецЦикла;
	
	Возврат НовыйТелефон;
	
КонецФункции	

//Формируется список доступных типов поля ввода, и после выбора из списка 
//нужного типа открывается форма выбора.
//
Процедура CRMОткрытьПодборПолучателя(Форма,Элемент) Экспорт
	
	// определим типы 
	МассивТипов=Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	
	СписокВидов=Новый СписокЗначений();
	Для Сч=0 По МассивТипов.ВГраница() Цикл
		ПустоеЗначение=Новый (МассивТипов[Сч]);
		СписокВидов.Добавить(ПустоеЗначение.Метаданные().Имя,ПустоеЗначение.Метаданные().Синоним);
	КонецЦикла;
	
	// упорядочим
	//СписокВидов.СортироватьПоПредставлению();
	// выбираем вид
	ВыбВид=Неопределено;
	Если СписокВидов.Количество()>1 Тогда
		ВыбВид=Форма.ВыбратьИзСписка(СписокВидов,Элемент);
	Иначе
		ВыбВид=СписокВидов[0];
	КонецЕсли;
	// проверим что выбрали
	Если ВыбВид=Неопределено Тогда Возврат; КонецЕсли;
	// откроем форму списка документов. тут одна хитрость: 
	// в качестве владельца формы выбора устанавливаем данный элемент, чтобы выбранное значение было присвоено стандартно 
	ФормаВыбора=Справочники[ВыбВид.Значение].ПолучитьФормуВыбора(,Элемент,);
	// открываем формы выбора
	ФормаВыбора.Открыть();
	
КонецПроцедуры	

// Функция возвращает значение по умолчанию для передаваемого пользователя и настройки.
//
// Параметры:
//  Пользователь - текущий пользователь программы
//  Настройка    - признак, для которого возвращается значение по умолчанию
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Процедура CRMУстановитьЗначениеНастройкиПользователя(Пользователь, Настройка, Значение) Экспорт

	НастройкаПользователя = РегистрыСведений.ПраваИНастройки.СоздатьМенеджерЗаписи();
	НастройкаПользователя.Объект = Пользователь;
	НастройкаПользователя.ПравоНастройка = ПланыВидовХарактеристик.ПраваИНастройки[Настройка];
	НастройкаПользователя.Значение = Значение;
	НастройкаПользователя.Записать(Истина);
	
КонецПроцедуры

// Процедура выполняет проверку и обновление регистра сведений 
// Контактная информация. Заполняется новое поле CRM_ПолеХраненияНомера,
// которое служит аналогичным числовым полем, либо Полю3, либо Полю4, с префиксом в начале.
//
Процедура CRMЗаполнениеПоляХраненияНомераРегистраКИ(ЧислоХранимыхЦифрНомера, МаксимальнаяДлинаВнутреннегоНомера) Экспорт
	
	ОбновлениеЗавершено = Ложь; НомерВыборки = 1; ОбъемВыборки = 50000;
	// Определим количество
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип"; 
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда Возврат; КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ОбщееКоличествоВыборок = Цел(Выборка.Количество / ОбъемВыборки) + 1;

	Пока НЕ ОбновлениеЗавершено Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ "+CRMФорматЧислоВСтроку(ОбъемВыборки)+"
		|	*
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|
		|ГДЕ
		|	КонтактнаяИнформация.Тип = &Тип"; 
		
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
		Результат = Запрос.Выполнить();
		ТаблицаРезультат = Результат.Выгрузить();
		
		// Проверяем есть ли ошибочные строки в регистре. Если есть то их необходимо исправить
		ОбщееКоличество = ТаблицаРезультат.Количество();
		Если ОбщееКоличество = 0 Тогда
			ОбновлениеЗавершено = Истина;
		Иначе
			КоличествоВТранзакции = 10000; Ном = 0; НомерПоПорядку = 0;
			НачатьТранзакцию();
			Для каждого ТекущаяСтрока Из ТаблицаРезультат Цикл
				НоваяЗапись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущаяСтрока);
				ТекущаяСтрока.Поле3         = CRMУбратьИзНомераТелефонаВсеПрефиксы(CRMУбратьИзНомераТелефонаВсеБуквы(ТекущаяСтрока.Поле3));
				ТекущаяСтрока.Поле4			= CRMУбратьИзНомераТелефонаВсеПрефиксы(CRMУбратьИзНомераТелефонаВсеБуквы(ТекущаяСтрока.Поле4));
				ТекущаяСтрока.Представление	= CRMУбратьИзНомераТелефонаВсеПрефиксы(CRMУбратьИзНомераТелефонаВсеБуквы(ТекущаяСтрока.Представление));
				
				Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Поле3) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Поле4) И ЗначениеЗаполнено(ТекущаяСтрока.Представление) Тогда
					ВремНомер = ТекущаяСтрока.Представление;
					Если СтрДлина(ВремНомер) <= МаксимальнаяДлинаВнутреннегоНомера Тогда
						НоваяЗапись.Поле4 = ВремНомер;
						НоваяЗапись.CRM_ПолеХраненияНомера = CRMПреобразоватьНомерДляСохранения(НоваяЗапись.Поле4, ЧислоХранимыхЦифрНомера);
					Иначе
						НоваяЗапись.Поле3 = ВремНомер;
						НоваяЗапись.CRM_ПолеХраненияНомера = CRMПреобразоватьНомерДляСохранения(НоваяЗапись.Поле3, ЧислоХранимыхЦифрНомера);
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Поле3) Тогда
					// вид так же может быть строкой
					//  проверим это
					Если НЕ (ТипЗнч(НоваяЗапись.Вид) = Тип("Строка"))
						И (НоваяЗапись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый) Тогда
						НоваяЗапись.CRM_ПолеХраненияНомера = CRMПреобразоватьНомерДляСохранения(ТекущаяСтрока.Поле1+ТекущаяСтрока.Поле2+ТекущаяСтрока.Поле3, 10);				
					Иначе	
						НоваяЗапись.CRM_ПолеХраненияНомера = CRMПреобразоватьНомерДляСохранения(ТекущаяСтрока.Поле1+ТекущаяСтрока.Поле2+ТекущаяСтрока.Поле3, ЧислоХранимыхЦифрНомера);
					КонецЕсли;	
				ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Поле4) Тогда
					НоваяЗапись.CRM_ПолеХраненияНомера = CRMПреобразоватьНомерДляСохранения(ТекущаяСтрока.Поле4, ЧислоХранимыхЦифрНомера);
				Иначе
					НоваяЗапись.CRM_ПолеХраненияНомера = -1;
				КонецЕсли;
				Ном = Ном + 1;
				
				НоваяЗапись.Записать(Истина);
				// Если запись подошла к максимальной в транзакции, то выполним ее
				Если Ном = КоличествоВТранзакции Тогда
					// Фиксируем транзакцию по достижению нужного количества записей
					Попытка
						ЗафиксироватьТранзакцию();
						НачатьТранзакцию();
						Ном = 0;
					Исключение
						ОтменитьТранзакцию();
						Сообщить(ОписаниеОшибки());
						Прервать;
					КонецПопытки;
				КонецЕсли;
				
				// Информируем пользователя сколько осталось обработать
				НомерПоПорядку = НомерПоПорядку + 1;
				Состояние("Обновление регистра сведений контактной информации (Общее количество ("+ОбщееКоличествоВыборок+"/"+НомерВыборки+"):Текущее количество ("+ОбщееКоличество+"/"+НомерПоПорядку+"))");
			КонецЦикла;
			
			// фиксируем оставшуюся транзакцию
			Попытка
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				Сообщить(ОписаниеОшибки());
				Сообщить("Обновление регистра сведений контактной информации не выполнено, найдены ошибки !", 10);
				Возврат;
			КонецПопытки;

		КонецЕсли;
		НомерВыборки = НомерВыборки + 1;
		// Проверим зацикливание, если число выборок превышает максимальное, значит что то не так..
		//  надо выйти их цикла
		Если ОбщееКоличествоВыборок < НомерВыборки Тогда
			ОбновлениеЗавершено = Истина;
		КонецЕсли;
	КонецЦикла;
	//Сообщить("Обновление регистра сведений контактная информация завершено успешно !");
	
КонецПроцедуры	

// Оставляет в номере телефона только цифры, все остальные символы удаляются.
//
Функция CRMУбратьИзНомераТелефонаВсеБуквы(НомерТелефона) Экспорт
	ТолькоЦифрыНомера = "";
	Для а=1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("1234567890",Сред(НомерТелефона,а,1)) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТелефона,а,1);
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифрыНомера;
КонецФункции

// Функция сначала убирает из номера телефона все не относящееся к цифрам, а
// затем обрезает значащее количество цифр справа телефонного номера,
// количество этих цифр задается в константе CRM_КоличествоХранимыхЦифрТелефона
// возвращает число.
//
Функция CRMПреобразоватьНомерДляСохранения(Знач НомерТелефона, ЧислоСимволов) Экспорт
	Префикс = "1";
	НомерТелефона = CRMУбратьИзНомераТелефонаВсеБуквы(НомерТелефона);
	Возврат ?(НЕ ЗначениеЗаполнено(НомерТелефона), 0, Число(Префикс + Прав(СокрЛП(НомерТелефона), ЧислоСимволов)));
КонецФункции

// Функция возвращает номер телефона в котором убраны все смиволы, кроме цифр
//
// Параметры:
//	НомерТелефона	- Строка	- Номер телефона
//
// Возвращаемое значение:
//	Строка	- Очищенный номер телефона
//
Функция CRMУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона) Экспорт
	Если НЕ (ТипЗнч(НомерТелефона) = Тип("Строка")) Тогда
		Возврат НомерТелефона;
	КонецЕсли;	
	СтрокаЦифр = "0123456789";
	ОчищенныйНомер = "";
	ДлинаНомера = СтрДлина(НомерТелефона);
	Для НомерСимвола = 1 По ДлинаНомера Цикл
		ТекущийСимвол = Сред(НомерТелефона, НомерСимвола, 1);
		Если Найти(СтрокаЦифр, ТекущийСимвол) > 0 Тогда
			ОчищенныйНомер = ОчищенныйНомер + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;
	Возврат ОчищенныйНомер;
КонецФункции // CRMУбратьИзНомераТелефонаВсеПрефиксы()

// Функция возвращает число в виде строки без разделителей, 
//  т.е. число "33 333" будет преобразовано в "33333".
//
Функция CRMФорматЧислоВСтроку(Знач ЧислоДоФормата) Экспорт
	Возврат (СтрЗаменить(Формат(ЧислоДоФормата, "ЧРГ=' '"), " ", ""));
КонецФункции

// Процедура устанавливает кэшируемым переменным значения
// настроек и констант.
//
Процедура CRMУстановитьЗначенияПоУмолчанию(глТекущийПользователь, глКодГорода, глКодСтраны, глКоличествоХранимыхЦифрТелефона, глПрефиксВыходаВГород, глПрефиксВыходаНаМежгород, глМаксимальнаяДлинаВнутреннегоНомера) Экспорт
	// Получаем значения констант
	глКодГорода 							 = СокрЛП(Константы.CRM_КодГорода.Получить());
	глКодСтраны 							 = СокрЛП(Константы.CRM_КодСтраны.Получить());
	глКоличествоХранимыхЦифрТелефона 	 	 = Константы.CRM_КоличествоХранимыхЦифрТелефона.Получить();
	глПрефиксВыходаВГород 				  	 = СокрЛП(Константы.CRM_ПрефиксВыходаВГород.Получить());
	глПрефиксВыходаНаМежгород				 = СокрЛП(Константы.CRM_ПрефиксВыходаНаМежгород.Получить());
	глМаксимальнаяДлинаВнутреннегоНомера 	 = Константы.CRM_МаксимальнаяДлинаВнутреннегоНомера.Получить();
	// Устанавливаем значения по умолчанию, при условии, что они не были настроены администратором
	Если глКоличествоХранимыхЦифрТелефона = 0 Тогда
		глКоличествоХранимыхЦифрТелефона = 10;
		Константы.CRM_КоличествоХранимыхЦифрТелефона.Установить(глКоличествоХранимыхЦифрТелефона);
	КонецЕсли;
	Если глМаксимальнаяДлинаВнутреннегоНомера = 0 Тогда
		глМаксимальнаяДлинаВнутреннегоНомера = 4;
		Константы.CRM_МаксимальнаяДлинаВнутреннегоНомера.Установить(глМаксимальнаяДлинаВнутреннегоНомера);
	КонецЕсли;
КонецПроцедуры	

// Первоначальное заполнение информационной базы
// по очереди происходит обновление ИБ, для каждой из компонент.
//
Процедура CRMОбновитьИнформационнуюБазу(МетаданныеВерсия, глКоличествоХранимыхЦифрТелефона, ИмяОборудования) Экспорт
	//////////////////////////////////////////////////////////////////
	///////// Устанавливаем константы по умолчанию для всей системы
	///////// Максимальную длину внутреннего номера 4 символа
	///////// Количество образуемых и хранимых цифр номера 10
	///////// Тип используемого СофтФона, в зависимости от того, кто загружен
	//
	
	Обновили = Ложь;
	Попытка
		
		Если НЕ ЗначениеЗаполнено(Константы.CRM_ИспользуемыйСофтФон.Получить()) Тогда 
			Если ИмяОборудования = "СофтФонПроф" Тогда
				Константы.CRM_ИспользуемыйСофтФон.Установить(Перечисления.CRM_ИспользуемыйСофтФон.СофтФонПроф);
			КонецЕсли;
			Обновили = Истина;
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(Константы.CRM_МаксимальнаяДлинаВнутреннегоНомера.Получить()) Тогда 
			Константы.CRM_МаксимальнаяДлинаВнутреннегоНомера.Установить(4);
			Обновили = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Константы.CRM_КоличествоХранимыхЦифрТелефона.Получить()) Тогда 
			Константы.CRM_КоличествоХранимыхЦифрТелефона.Установить(10);
			Обновили = Истина;
		КонецЕсли;
		Если Обновили Тогда Сообщить("Обновление констант завершено успешно !"); КонецЕсли;
	Исключение
		Предупреждение("Обновление констант не выполнено, найдены ошибки !", 10);
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//////////////////////////////////////////////////////////////////
	///////// Выполняем первоначальное заполнение справочника Виды
	////////  Контактной информации
	//                                       
		
	ТекОбъектТелефонВнутренний	= Справочники.ВидыКонтактнойИнформации.ТелефонВнутренний.ПолучитьОбъект();
	ТекОбъектТелефонАОН 		= Справочники.ВидыКонтактнойИнформации.ТелефонАОН.ПолучитьОбъект();
	
	ТекОбъектМобильныйТелефон 	= Справочники.ВидыКонтактнойИнформации.МобильныйТелефон.ПолучитьОбъект();
	ТекОбъектФакс 				= Справочники.ВидыКонтактнойИнформации.Факс.ПолучитьОбъект();
	ТекОбъектФаксАОН 			= Справочники.ВидыКонтактнойИнформации.ФаксАОН.ПолучитьОбъект();

	
	// Определяем жесткий тип для контактной информации
	// Тип - установим в телефон
	Если ТекОбъектТелефонВнутренний.Тип.Пустая() Или НЕ ТекОбъектТелефонВнутренний.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ТекОбъектТелефонВнутренний.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	КонецЕсли;
	Если ТекОбъектТелефонАОН.Тип.Пустая() Или НЕ ТекОбъектТелефонАОН.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ТекОбъектТелефонАОН.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	КонецЕсли;
	
	Если ТекОбъектМобильныйТелефон.Тип.Пустая() Или НЕ ТекОбъектМобильныйТелефон.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ТекОбъектМобильныйТелефон.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	КонецЕсли;
	Если ТекОбъектФакс.Тип.Пустая() Или НЕ ТекОбъектФакс.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ТекОбъектФакс.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	КонецЕсли;
	Если ТекОбъектФаксАОН.Тип.Пустая() Или НЕ ТекОбъектФаксАОН.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		ТекОбъектФаксАОН.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	КонецЕсли;
	
	// ВидОбъектаКИ - установим в пользователь
	Если ТекОбъектТелефонВнутренний.ВидОбъектаКонтактнойИнформации.Пустая() Или НЕ ТекОбъектТелефонВнутренний.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи Тогда
		ТекОбъектТелефонВнутренний.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи;
	КонецЕсли;
	Если ТекОбъектТелефонАОН.ВидОбъектаКонтактнойИнформации.Пустая() Или НЕ ТекОбъектТелефонАОН.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи Тогда
		ТекОбъектТелефонАОН.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи;
	КонецЕсли;
	
	Если ТекОбъектМобильныйТелефон.ВидОбъектаКонтактнойИнформации.Пустая() Или НЕ ТекОбъектМобильныйТелефон.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи Тогда
		ТекОбъектМобильныйТелефон.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи;
	КонецЕсли;
	Если ТекОбъектФакс.ВидОбъектаКонтактнойИнформации.Пустая() Или НЕ ТекОбъектФакс.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи Тогда
		ТекОбъектФакс.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи;
	КонецЕсли;
	Если ТекОбъектФаксАОН.ВидОбъектаКонтактнойИнформации.Пустая() Или НЕ ТекОбъектФаксАОН.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи Тогда
		ТекОбъектФаксАОН.ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи;
	КонецЕсли;
	
	// CRM_ИдентификаторВида - проверяем идентификатор вида
	Если НЕ ЗначениеЗаполнено(ТекОбъектТелефонВнутренний.CRM_ИдентификаторВида) Или НЕ ТекОбъектТелефонВнутренний.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ТелефонВнутренний Тогда
		ТекОбъектТелефонВнутренний.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ТелефонВнутренний;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекОбъектТелефонАОН.CRM_ИдентификаторВида) Или НЕ ТекОбъектТелефонАОН.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ТелефонАОН Тогда
		ТекОбъектТелефонАОН.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ТелефонАОН;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекОбъектМобильныйТелефон.CRM_ИдентификаторВида) Или НЕ ТекОбъектМобильныйТелефон.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.МобильныйТелефон Тогда
		ТекОбъектМобильныйТелефон.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.МобильныйТелефон;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекОбъектФакс.CRM_ИдентификаторВида) Или НЕ ТекОбъектФакс.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.Факс Тогда
		ТекОбъектФакс.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.Факс;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекОбъектФаксАОН.CRM_ИдентификаторВида) Или НЕ ТекОбъектФаксАОН.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ФаксАОН Тогда
		ТекОбъектФаксАОН.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ФаксАОН;
	КонецЕсли;
	
	// Записываем объекты
	ТекОбъектТелефонВнутренний.Записать();
	ТекОбъектТелефонАОН.Записать();
	
	ТекОбъектМобильныйТелефон.Записать();
	ТекОбъектФакс.Записать();
	ТекОбъектФаксАОН.Записать();
		
	// Если пользователи то не нужно...уже был такой.
	// выполним поиск, а может уже есть такие элементы
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКонтактнойИнформации.Ссылка,
	|	ВидыКонтактнойИнформации.Наименование,
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации,
	|	ВидыКонтактнойИнформации.Тип
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Тип = &Тип
	|	И НЕ ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &Вид";

	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущийВидКИ Из Перечисления.ВидыОбъектовКонтактнойИнформации Цикл
		// Пользователей пропустим, так как есть предопределенный элемент, который устанавливается для пользователя
		Если ТекущийВидКИ = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи Тогда Продолжить; КонецЕсли;
		
		НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(Новый Структура("ВидОбъектаКонтактнойИнформации", ТекущийВидКИ)); 
		
		// Выполняем поиск и добавление
		РезультатПоискаВнутреннегоНомера = Ложь; РезультатПоискаАОНа = Ложь;
		РезультатПоискаМобильногоТелефона = Ложь; РезультатПоискаФакса = Ложь;
		РезультатПоискаФаксаАОНа = Ложь;	
		
		Для каждого ТекущаяНайденнаяСтрока Из НайденныеСтроки Цикл
			Если Не Найти(ТекущаяНайденнаяСтрока.Наименование, ТекОбъектТелефонВнутренний.Наименование) = 0 Тогда
				РезультатПоискаВнутреннегоНомера = Истина;
			КонецЕсли;
			Если Не Найти(ТекущаяНайденнаяСтрока.Наименование, ТекОбъектТелефонАОН.Наименование) = 0 Тогда
				РезультатПоискаАОНа = Истина;
			КонецЕсли;
			
			Если Не Найти(ТекущаяНайденнаяСтрока.Наименование, ТекОбъектМобильныйТелефон.Наименование) = 0 Тогда
				РезультатПоискаМобильногоТелефона = Истина;
			КонецЕсли;
			Если Не Найти(ТекущаяНайденнаяСтрока.Наименование, ТекОбъектФакс.Наименование) = 0 Тогда
				РезультатПоискаФакса = Истина;
			КонецЕсли;
			Если Не Найти(ТекущаяНайденнаяСтрока.Наименование, ТекОбъектФаксАОН.Наименование) = 0 Тогда
				РезультатПоискаФаксаАОНа = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		// Если не нашли, то создадим новый внутренний номер
		Если Не РезультатПоискаВнутреннегоНомера Тогда
			НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
			НовыйВидКИ.Наименование = ТекОбъектТелефонВнутренний.Наименование;
			НовыйВидКИ.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ТелефонВнутренний;
			НовыйВидКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НовыйВидКИ.ВидОбъектаКонтактнойИнформации = ТекущийВидКИ;
			НовыйВидКИ.Записать();
		КонецЕсли;
		
		// Если не нашли, то создадим новый АОН
		Если Не РезультатПоискаАОНа Тогда
			НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
			НовыйВидКИ.Наименование = ТекОбъектТелефонАОН.Наименование;
			НовыйВидКИ.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ТелефонАОН;
			НовыйВидКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НовыйВидКИ.ВидОбъектаКонтактнойИнформации = ТекущийВидКИ;
			НовыйВидКИ.Записать();
		КонецЕсли;
		
		Если Не РезультатПоискаМобильногоТелефона Тогда
			НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
			НовыйВидКИ.Наименование = ТекОбъектМобильныйТелефон.Наименование;
			НовыйВидКИ.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.МобильныйТелефон;
			НовыйВидКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НовыйВидКИ.ВидОбъектаКонтактнойИнформации = ТекущийВидКИ;
			НовыйВидКИ.Записать();
		КонецЕсли;
		
		Если Не РезультатПоискаФакса Тогда
			НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
			НовыйВидКИ.Наименование = ТекОбъектФакс.Наименование;
			НовыйВидКИ.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.Факс;
			НовыйВидКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НовыйВидКИ.ВидОбъектаКонтактнойИнформации = ТекущийВидКИ;
			НовыйВидКИ.Записать();
		КонецЕсли;
		
		Если Не РезультатПоискаФаксаАОНа Тогда
			НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
			НовыйВидКИ.Наименование = ТекОбъектФаксАОН.Наименование;
			НовыйВидКИ.CRM_ИдентификаторВида = Перечисления.CRM_ВидыТелефонов.ФаксАОН;
			НовыйВидКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НовыйВидКИ.ВидОбъектаКонтактнойИнформации = ТекущийВидКИ;
			НовыйВидКИ.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить("Обновление справочника виды контактной информации завершено успешно !");
	
	//////////////////////////////////////////////////////////////////
	///////// Выполняем проверку и обновление регистра сведений 
	/////////  Контактная информация. Заполняем новое поле CRM_ПолеХраненияНомера
	/////////  которое служит аналогичным числовым полем либо Полю3 либо Полю4, с префиксом в начале.
	//
	CRMЗаполнениеПоляХраненияНомераРегистраКИ(глКоличествоХранимыхЦифрТелефона, Константы.CRM_МаксимальнаяДлинаВнутреннегоНомера.Получить());
	//-CRM
	//первоначальное заполнение справочника "Действия" из макета
	//Макет = Справочники.CRM_Действия.ПолучитьМакет("Макет");
	//
	//// Переберем строки макета
	//Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл  // в первой строке описание, его не учитываем
	//	
	//	Наименование    = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
	//	
	//	Если Справочники.CRM_Действия.НайтиПоНаименованию(Наименование,Истина).Пустая() Тогда
	//		
	//		НовыйЭлемент = Справочники.CRM_Действия.СоздатьЭлемент();
	//		НовыйЭлемент.Наименование = Наименование;
	//		НовыйЭлемент.Представление = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
	//		НовыйЭлемент.Действие = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
	//		НовыйЭлемент.Автотекст = Булево(Число(СокрЛП(Макет.Область(НомерСтроки,4).Текст)));
	//		НовыйЭлемент.Записать();
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;
    //+CRM
	Сообщить("Обновление справочника Действия завершено успешно !");
КонецПроцедуры	

// Функция устанавливает признак Прочитано у документов Факс-сообщение и SMS-сообщение. 
// Вызывается из форм списков документов. Для текущего пользователя проверяется наличие напоминания.
//
Процедура CRMУстановитьПризнакПрочтенияСообщения(Документ,глТекущийПользователь) Экспорт 
	
	ОтменитьНапоминание = Ложь;
	//Если Документ.Ответственный = глТекущийПользователь И Документ.НапомнитьОСобытии Тогда
	//	
	//	ТекстВопроса = Строка(Документ)+ " прочитано. Отменить напоминание?";			
	//	Ответ  = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
	//	Если Ответ = КодВозвратаДиалога.Да Тогда
	//		ОтменитьНапоминание = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Если НЕ Документ.Прочитано ИЛИ ОтменитьНапоминание  Тогда
		
		Объект = Документ.ПолучитьОбъект();
		Объект.Прочитано = Истина;
		
		//Если  ОтменитьНапоминание Тогда
		//	Объект.НапомнитьОСобытии = Ложь;
		//КонецЕсли;
		
		Попытка
			Объект.Записать()
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры	

// Функция вовзращает выборку владельцев из регистра КИ телефона.
//
Функция CRMВладелецТелефона(Телефон,глКоличествоХранимыхЦифрТелефона) Экспорт
		
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Представление,
	               |	КонтактнаяИнформация.Поле1,
	               |	КонтактнаяИнформация.Поле2,
	               |	КонтактнаяИнформация.Поле3,
	               |	КонтактнаяИнформация.Поле4
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
				   |ГДЕ
				   |	(КонтактнаяИнформация.Вид.CRM_ИдентификаторВида <> &Вид
				   |				И КонтактнаяИнформация.CRM_ПолеХраненияНомера = &CRM_ПолеХраненияНомераТелефона
				   |			ИЛИ КонтактнаяИнформация.Вид.CRM_ИдентификаторВида = &Вид
				   |				И КонтактнаяИнформация.CRM_ПолеХраненияНомера = &CRM_ПолеХраненияНомераМобильного)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	
	Запрос.УстановитьПараметр("Вид",Перечисления.CRM_ВидыТелефонов.МобильныйТелефон);
	Запрос.УстановитьПараметр("CRM_ПолеХраненияНомераТелефона",CRMПреобразоватьНомерДляСохранения(Телефон, глКоличествоХранимыхЦифрТелефона));
	Запрос.УстановитьПараметр("CRM_ПолеХраненияНомераМобильного",CRMПреобразоватьНомерДляСохранения(Телефон, 10));
	
	Возврат Запрос.Выполнить();
	
КонецФункции	

// Функция вовзращает форму выбора владельца телефона.
//
Функция CRMПолучитьФормуВыбораКонтакта(Результат,НомерТелефона)  Экспорт
	
	
	// Добавляем в выгрузку колонку с типом объекта, для ускорения поиска
	ТаблицаЗначений = Результат.Выгрузить();
	
	Если ТаблицаЗначений.Количество() = 1 Тогда
		Объект =  ТаблицаЗначений[0].Объект;
		Форма =  Объект.ПолучитьФорму("ФормаСписка",,) ;
		Форма.НачальноеЗначениеВыбора = Объект;
		Форма.ЗакрыватьПриВыборе = Истина;
		Форма.РежимВыбора = Истина;

		Возврат Форма;
	КонецЕсли;	
	
	ТаблицаЗначений.Колонки.Добавить("ТипОбъекта");
	Для каждого ТекущаяСтрока Из ТаблицаЗначений Цикл
		ТекущаяСтрока.ТипОбъекта = ТипЗнч(ТекущаяСтрока.Объект);
	КонецЦикла; 
	
		
	ФормаВыбораКонтакта = ПолучитьОбщуюФорму("CRM_ВыборКонтакта");
	ФормаВыбораКонтакта.Заголовок = "Выбрать контакт (Номер: "+НомерТелефона+")";
	ДеревоКонтактов = ФормаВыбораКонтакта.мКонтакты;
	ДеревоКонтактов.Строки.Очистить();
	
	// Cформируем связку контрагента и контактного лица, следующим образом. Сначала идет контрагент, 
	// затем все относящиеся к нему
	//  контактные лица. Если найдутся контактные лица не относящиеся к контрагенту, 
	//  они будут добавлены в ветку контактных лиц.
	// >>>>> НАЧАЛО
	МассивКонтрагентов  = ТаблицаЗначений.НайтиСтроки(Новый Структура("ТипОбъекта", Тип("СправочникСсылка.Контрагенты")));
	НетКонтрагентов = Истина; НетКонтактныхЛиц = Истина;
	
	Если НетКонтрагентов Тогда
		СтрокаРодительКонтрагентов = ДеревоКонтактов.Строки.Добавить();
		ФормаВыбораКонтакта.ЗаполнитьСтроку(СтрокаРодительКонтрагентов, Тип("СправочникСсылка.Контрагенты"), Метаданные.Справочники.Контрагенты.Представление(), "СправочникОбъект");
	КонецЕсли;
	// Цикл по контрагентам
	Для каждого СтрокаТекущийКонтрагент Из МассивКонтрагентов Цикл
		// Проверим такой контрагент, мог быть добавлен при прохождении по контактным лицам
		Если СтрокаРодительКонтрагентов.Строки.Найти(СтрокаТекущийКонтрагент.Объект, "Объект", Истина) = Неопределено Тогда
			НоваяСтрока = СтрокаРодительКонтрагентов.Строки.Добавить();
			ФормаВыбораКонтакта.ЗаполнитьСтроку(НоваяСтрока, СтрокаТекущийКонтрагент.Объект, СтрокаТекущийКонтрагент.Объект, , СтрокаТекущийКонтрагент.Поле1, СтрокаТекущийКонтрагент.Поле2, СтрокаТекущийКонтрагент.Поле3, СтрокаТекущийКонтрагент.Поле4, СтрокаТекущийКонтрагент.Представление);
			НетКонтрагентов = Ложь;
		КонецЕсли;
	КонецЦикла;
	// Если контрагентов не было ... то удалим и группу
	Если НетКонтрагентов Тогда
		ДеревоКонтактов.Строки.Удалить(СтрокаРодительКонтрагентов);
	КонецЕсли;
	// <<<<< КОНЕЦ
	
	// Определим типы значений, которые может принимать объект
	МассивТиповОбъектовКонтактнойИнформации = Метаданные.РегистрыСведений.КонтактнаяИнформация.Измерения.Объект.Тип.Типы();
	Для Каждого ТекущийТип Из МассивТиповОбъектовКонтактнойИнформации Цикл
		
		// исключим из просмотра контрагентов и контактных лиц, они были сформированы выше
		Если ТекущийТип = Тип("СправочникСсылка.Контрагенты") Тогда Продолжить; КонецЕсли;
		
		ЕстьЗначения = Ложь;
		СтрокаРодитель = ДеревоКонтактов.Строки.Добавить();
		ФормаВыбораКонтакта.ЗаполнитьСтроку(СтрокаРодитель, ТекущийТип, Метаданные.НайтиПоТипу(ТекущийТип).Представление(), "СправочникОбъект");

		НайденныеСтроки = ТаблицаЗначений.НайтиСтроки(Новый Структура("ТипОбъекта", ТекущийТип));
		Для каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			НоваяСтрока = СтрокаРодитель.Строки.Добавить();
			ФормаВыбораКонтакта.ЗаполнитьСтроку(НоваяСтрока, ТекущаяСтрока.Объект, ТекущаяСтрока.Объект, , ТекущаяСтрока.Поле1, ТекущаяСтрока.Поле2, ТекущаяСтрока.Поле3, ТекущаяСтрока.Поле4, ТекущаяСтрока.Представление);
			ЕстьЗначения = Истина;
		КонецЦикла;
		
		// Если значений не было ... то удалим и группу
		Если НЕ ЕстьЗначения Тогда
			ДеревоКонтактов.Строки.Удалить(СтрокаРодитель);
		КонецЕсли;
		
	КонецЦикла;

	ФормаВыбораКонтакта.ЭлементыФормы.Контакты.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
    ФормаВыбораКонтакта.ЗакрыватьПриВыборе = Ложь;
	Возврат ФормаВыбораКонтакта;
	
КонецФункции	

#КонецЕсли

// Функция возвращает список телефонов  переданного объекта 
// владельца контактной информации.
//
Функция CRMПолучитьСписокТелефоновОбъекта(Объект,ВидыТелефонов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид КАК Вид,
	               |	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	               |	КонтактнаяИнформация.Поле1,
	               |	КонтактнаяИнформация.Поле2,
	               |	КонтактнаяИнформация.Поле3,
	               |	КонтактнаяИнформация.Поле4,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Вид.CRM_ИдентификаторВида В (&Виды)
	               |	И КонтактнаяИнформация.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вид";
	
	Запрос.УстановитьПараметр("Объект",Объект);	
	Запрос.УстановитьПараметр("Виды",ВидыТелефонов);

	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	
	СписокТелефонов = Новый СписокЗначений;
	ТаблицаКонтактнойИнформации = Результат.Выгрузить();

	Если (ТаблицаКонтактнойИнформации.Количество() > 0) Тогда
		
		НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(Новый Структура("ЗначениеПоУмолчанию", Истина));
		Если НайденныеСтроки.Количество()>0 Тогда
			ТекущаяКонтактнаяИнформация = НайденныеСтроки[0];
		Иначе
			ТекущаяКонтактнаяИнформация = ТаблицаКонтактнойИнформации.Получить(0);
		КонецЕсли;

		СтруктураНомера = CRMСформироватьСтруктуруНомераИзПолей(ТекущаяКонтактнаяИнформация);
		СтруктураНомера.Вставить("Объект", ТекущаяКонтактнаяИнформация.Объект);
		СписокТелефонов.Добавить(СтруктураНомера, СокрЛП(ТекущаяКонтактнаяИнформация.Вид)
		+ ": " + ТекущаяКонтактнаяИнформация.Представление);
		ТаблицаКонтактнойИнформации.Удалить(ТекущаяКонтактнаяИнформация);
	КонецЕсли;
	
	Для каждого ТекущаяКонтактнаяИнформация Из ТаблицаКонтактнойИнформации Цикл
		
		СтруктураТелефона = CRMСформироватьСтруктуруНомераИзПолей(ТекущаяКонтактнаяИнформация);
		СписокТелефонов.Добавить(СтруктураТелефона,СокрЛП(ТекущаяКонтактнаяИнформация.Вид)
		+ ": " + ТекущаяКонтактнаяИнформация.Представление);
		
	КонецЦикла;
		
	Возврат СписокТелефонов;
		
КонецФункции

#Если Клиент Тогда

// Функция возвращает первый найденный телефон заданного вида
// будет возращен основной телефон, иначе - первый из списка.
//
Функция CRMПолучитьТелефон(Объект,ВидыТелефонов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид КАК Вид,
	               |	КонтактнаяИнформация.ЗначениеПоУмолчанию,
	               |	КонтактнаяИнформация.Поле1,
	               |	КонтактнаяИнформация.Поле2,
	               |	КонтактнаяИнформация.Поле3,
	               |	КонтактнаяИнформация.Поле4,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Вид.CRM_ИдентификаторВида В (&Виды)
	               |	И КонтактнаяИнформация.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вид";
	
	Запрос.УстановитьПараметр("Объект",Объект);	
	Запрос.УстановитьПараметр("Виды",ВидыТелефонов);

	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ЗаписьКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат ЗаписьКИ;
	КонецЕсли;	
	
	
	
	Пока Выборка.НайтиСледующий(Истина,"ЗначениеПоУмолчанию") Цикл	
		
		ЗаписьКИ.Объект = Выборка.Объект;
		ЗаписьКИ.Тип    = Выборка.Тип;
		ЗаписьКИ.Вид    = Выборка.Вид;
		ЗаписьКИ.Прочитать();
		
		Возврат ЗаписьКИ; 
		
	КонецЦикла;
	
	Если  Выборка.Количество() = 1 Тогда
		
		Пока Выборка.Следующий() Цикл
			ЗаписьКИ.Объект = Выборка.Объект;
			ЗаписьКИ.Тип    = Выборка.Тип;
			ЗаписьКИ.Вид    = Выборка.Вид;
			ЗаписьКИ.Прочитать();
			Возврат ЗаписьКИ;
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат ЗаписьКИ;
	
КонецФункции

// Процедура оповещает администраторов входящих сообщений
// не используется.
Процедура CRMОповеститьАдминистраторовВходящихСообщений(Документ,ТипСообщения) Экспорт
	
	Если ТипСообщения = "ВходящееФаксСообщение" тогда
		ТипАдминистратора = ПланыВидовХарактеристик.НастройкиПользователей.АдминистраторВходящихФаксСообщений;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПользователей.Пользователь
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Настройка = &Настройка
	|	И НастройкиПользователей.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Настройка",ТипАдминистратора);
	Запрос.УстановитьПараметр("Значение",Истина );	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    МенеджерЗаписи = РегистрыСведений.CRM_НастройкиИХранилище.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = Выборка.Пользователь;
		МенеджерЗаписи.Идентификатор = ТипСообщения;
		МенеджерЗаписи.Значение = Документ;
		МенеджерЗаписи.Записать();	
	КонецЦикла;
		
КонецПроцедуры

// Процедура открывает форму сообщения об ошибке подключения к переданному модулю
// CRM коммуникатора, так же если пользователь кликнул на гиперссылке "Подробная информация" -
// открывает справку по подсистеме оборудования.
// 
// Параметры:
//  ТипОборудования - СофтФон, SMSКоммуникатор, ФаксКоммуникатор.
//
Процедура CRMОткрытьСообщениеОшибкиПодключения(ТипОборудования) Экспорт
	ФормаСообщения = Обработки.CRM_СообщенияПодключения.Создать().ПолучитьФорму("Форма");
	ФормаСообщения.ТипОборудования = ТипОборудования;
	Рез = Неопределено;
	Рез = ФормаСообщения.ОткрытьМодально(30);
	// Если вернется значение не Неопределено, тогда необходимо
	//  открыть подсистему по переданному типу оборудования
	Если Рез = "СофтФон" Тогда
		ОткрытьСправку(Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.УчетныеБлоки.Подсистемы.Коммуникаторы);
	ИначеЕсли Рез = "SMSКоммуникатор" Тогда
		ОткрытьСправку(Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.УчетныеБлоки.Подсистемы.Коммуникаторы);
	КонецЕсли;
КонецПроцедуры

// Возвращает описание объекта.
//
Функция CRMСформироватьОписание(Объект, Описание = "") Экспорт
	
	стрПредставление = "<H4>" + Объект + "</H4>";
	стрРазделитель = "*** </BR>";
	Описание = Описание + стрПредставление + стрРазделитель;
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.Событие") 
	 Или ТипЗнч(Объект) = Тип("ДокументОбъект.Событие") Тогда
		
		стрТип = "<FONT Size = 2><B>Тип: </B>" + Объект.ТипСобытия + "</FONT></BR>";
		стрВид = "<FONT Size = 2><B>Вид: </B>" + Объект.ВидСобытия + "</FONT></BR>";
		
		стрНачало = "<FONT Size = 2><B>Начало: </B>" + Объект.НачалоСобытия + "</FONT></BR>";
		стрОкончание = "<FONT Size = 2><B>Окончание: </B>" + Объект.ОкончаниеСобытия + "</FONT></BR>";
		
		стрКонтрагент = "<FONT Size = 2><B>Контрагент: </B>" + Объект.Контрагент + "</FONT></BR>";
		стрКонтактноеЛицо = "<FONT Size = 2><B>Контактное лицо: </B>" + Объект.КонтактноеЛицо + "</FONT></BR>";
		
		стрОписание = "<FONT Size = 2><B>Описание: </B>" + Объект.ОписаниеСобытия + "</FONT></BR>";
		стрСодержание = "<FONT Size = 2><B>Содержание: </B>" + Объект.СодержаниеСобытия + "</FONT></BR>";
		
		стрКомментарий = "<FONT Size = 2><B>Комментарий: </B>" + Объект.Комментарий + "</FONT></BR>";
		
		стрАвтор = "<FONT Size = 2><B>Автор: </B>" + Объект.CRM_Автор + "</FONT></BR>";
		стрОтветственный = "<FONT Size = 2><B>Ответственный: </B>" + Объект.Ответственный + "</FONT></BR>";
		
		Описание = Описание + стрТип
							+ стрВид
							+ стрНачало
							+ стрОкончание
							+ стрРазделитель;
		
		Описание = Описание + стрКонтрагент
							+ стрКонтактноеЛицо
							+ стрРазделитель;
		
		Описание = Описание + стрОписание
							+ стрСодержание
							+ стрКомментарий
							+ стрРазделитель;
		
		Описание = Описание + стрАвтор
							+ стрОтветственный
							+ стрРазделитель;

							
	КонецЕсли;
						
	Возврат Описание;
КонецФункции

// Процедура обрабатывает внешние событие.
//
Процедура CRMОбработкаВнешнегоСобытия(Источник, Событие, Данные, РарусСофтФонПроф,
									  РарусСофтФонЛайт, РарусSMSКоммуникатор,
									  РарусФаксКоммуникатор) Экспорт
									  
	// {{{ СофтФон, Проф }}} НАЧАЛО Код встраивания в произвольную конфигурацию
	// Подключаем внешний обработчик для работы телефонии
	Если Источник = "RTUP" И НЕ (РарусСофтФонПроф = Неопределено) Тогда
		
		Если Событие = "Change" Тогда
			
			Попытка
				РарусСофтФонПроф.ИзменениеСостоянияЗвонка(Данные);
			Исключение
				// {{{ КОНФИГУРАЦИЯ }}} НАЧАЛО
				Сообщить("Ошибка при событии [Change] СофтФона, Проф:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
				// {{{ КОНФИГУРАЦИЯ }}} КОНЕЦ
			КонецПопытки;
			
		ИначеЕсли Событие = "LoginStateChange" Тогда
			
			Попытка
				РарусСофтФонПроф.ИзменениеСостоянияПодключения(Данные);
			Исключение
				// {{{ КОНФИГУРАЦИЯ }}} НАЧАЛО
				Сообщить("Ошибка при событии [LoginStateChange] СофтФона, Проф:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
				// {{{ КОНФИГУРАЦИЯ }}} КОНЕЦ
			КонецПопытки;
			
		ИначеЕсли Событие = "LineCloseOpen" Тогда
			
			Попытка
				РарусСофтФонПроф.ИзменениеСостоянияЛинии(Данные);
			Исключение
				// {{{ КОНФИГУРАЦИЯ }}} НАЧАЛО
				Сообщить("Ошибка при событии [LineCloseOpen] СофтФона, Проф:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
				// {{{ КОНФИГУРАЦИЯ }}} КОНЕЦ
			КонецПопытки;
			
		ИначеЕсли Событие = "LineLock" Тогда
			
			Попытка
				РарусСофтФонПроф.ИзменениеСатусаЛинии(Событие, Данные);
			Исключение
				// {{{ КОНФИГУРАЦИЯ }}} НАЧАЛО
				Сообщить("Ошибка при событии [LineLock] СофтФона, Проф:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
				// {{{ КОНФИГУРАЦИЯ }}} КОНЕЦ
			КонецПопытки;
			
		ИначеЕсли Событие = "LineUnLock" Тогда
			
			Попытка
				РарусСофтФонПроф.ИзменениеСатусаЛинии(Событие, Данные);
			Исключение
				// {{{ КОНФИГУРАЦИЯ }}} НАЧАЛО
				Сообщить("Ошибка при событии [LineUnLock] СофтФона, Проф:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
				// {{{ КОНФИГУРАЦИЯ }}} КОНЕЦ
			КонецПопытки;
			
		ИначеЕсли Событие = "LogParams" Тогда
			
			Попытка
				РарусСофтФонПроф.ИзменениеПараметровСервераСпискаЗвонков(Событие, Данные);
			Исключение
				// {{{ КОНФИГУРАЦИЯ }}} НАЧАЛО
				Сообщить("Ошибка при событии [LogParams] СофтФона, Проф:", СтатусСообщения.ОченьВажное);
				Сообщить(ОписаниеОшибки());
				// {{{ КОНФИГУРАЦИЯ }}} КОНЕЦ
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//обработка событий которые присылает Баннер
	Если Источник = "КОМПОНЕНТА" и Найти(Событие,"БАННЕР")>0 Тогда
		
		//Структура данных: "ИмяСобытияПосылаемогоБаннером_ИДБаннера"
		//Разбираем данные
		Событие = Лев(Данные,Найти(Данные,"_")-1);
		ИДБаннера = Прав(Данные,СтрДлина(Данные)-Найти(Данные,"_"));
		//+Отладка
		//Сообщить("Событие:"+Событие);
		//Сообщить("ИДБаннера:"+ИДБаннера);
		//-Отладка
		Попытка
			РарусСофтФонПроф.ОбработкаСобытияБаннера(Событие,ИДБаннера);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	// {{{ СофтФон, Проф }}} КОНЕЦ
	
	// {{{ SMS Коммуникатор}}} НАЧАЛО Код встраивания в произвольную конфигурацию	
	Если Источник = "Коммуникатор" И НЕ РарусSMSКоммуникатор = Неопределено Тогда 	
		Попытка                  
			РарусSMSКоммуникатор.ПолучитьСписокSMSСообщенийИзХранилищаОборудования();	
		Исключение
			// {{{ КОНФИГУРАЦИЯ }}} НАЧАЛО
			Сообщить("Ошибка при событии SMS компоненты:", СтатусСообщения.ОченьВажное);
			Сообщить(ОписаниеОшибки());
			// {{{ КОНФИГУРАЦИЯ }}} КОНЕЦ
		КонецПопытки;
	КонецЕсли;	
	// {{{ SMS Коммуникатор }}}  КОНЕЦ
	
	// {{{ Факс Коммуникатор}}} НАЧАЛО Код встраивания в произвольную конфигурацию	
	Если Источник = "Факс" И НЕ РарусФаксКоммуникатор = Неопределено Тогда 	
		
		Попытка
			РарусФаксКоммуникатор.ОбработкаВнешнегоСобытия();	
		Исключение
			// {{{ КОНФИГУРАЦИЯ }}} НАЧАЛО
			Сообщить("Ошибка при событии Факса:", СтатусСообщения.ОченьВажное);
			Сообщить(ОписаниеОшибки());
			// {{{ КОНФИГУРАЦИЯ }}} КОНЕЦ
		КонецПопытки;
		
	КонецЕсли;	
	// {{{ Факс Коммуникатор }}}  КОНЕЦ
	
КонецПроцедуры


//////////////////////////////////////////////////////////
//ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТОВ

// универсальный обработчик события "ОбработкаВыбора" в формах объектов
//
Процедура CRM_КоммуникаторОбработкаВыбора(ДокументОбъект, ДокументФорма, ЗначениеВыбора, Источник) Экспорт
	//
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	//
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	Попытка
		Текст = СтрЗаменить(ПолноеИмя, "CRM_", "");
		Текст = СтрЗаменить(Текст, ".", "");
		Текст = СтрЗаменить(Текст, "Документ", "");
		Выполнить("CRM_" + Текст + "ОбработкаВыбора(ДокументОбъект, ДокументФорма, ЗначениеВыбора, Источник)");
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	//
КонецПроцедуры

// универсальный обработчик события "ОбработкаВыбора" в формах объектов
//
Процедура CRM_КонтрагентПриИзменении(ДокументОбъект, ДокументФорма, Элемент) Экспорт
	//
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	//
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	Попытка
		Текст = СтрЗаменить(ПолноеИмя, "CRM_", "");
		Текст = СтрЗаменить(Текст, ".", "");
		Выполнить("CRM_" + Текст + "КонтрагентПриИзменении(ДокументОбъект, ДокументФорма, Элемент)");
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	//
КонецПроцедуры

#КонецЕсли

//////////////////////////////////
//CRM_Коммуникатор, работа с группами дерева

// Функция возвращает элемент группы событий.
//
Функция CRM_ПолучитьЭлемнтГруппыСообщений(Имя, Класс, Владелец) Экспорт
	
	ГруппыСообщений = Справочники.CRM_ГруппыСообщений;
	Отбор = Новый Структура("Наименование");
	Отбор.Наименование = Имя;
	//Отбор.Класс = Класс;
	
	Выборка = ГруппыСообщений.Выбрать(,Владелец,Отбор);
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Класс = Класс Тогда
			НайденнаяГруппа = Выборка.ПолучитьОбъект().Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденнаяГруппа = Неопределено Тогда
		Возврат Справочники.CRM_ГруппыСообщений.ПустаяСсылка();
	иначе
		Возврат НайденнаяГруппа;
	КонецЕсли;
	
КонецФункции
